# nohup(no hang up)
- 리눅스에서 프로세스를 실행한 터미널의 세션 연결이 끊어지더라도 지속적으로 동작할 수 있게 해주는 명렁어
- 터미널에서 로그아웃 발생 시 리눅스는 해당 터미널에서 실행한 프로세스들에게 HUP 신호를 전달하여 종료
- HUP 신호를 프로세스가 무시하도록하는 명령어
- **터미널에서 연결이 끊기거나 터미널을 종료해도 실행했던 프로세스들이 계속 실행

# 사용방법
- 중단 없이 실행하고자 하는 프로그램 명령어 앞에 `nohup`
- 예를들어<br>
  ``` $ nohup python preprocess.py $ ```
- 이 때 nohup으로 실행시킬 파일은 반드시 755퍼미션을 가지고 있어야 함<br>
<br>

### 리눅스 권한
- 파일을 서버에 전송하기 전 전송될 파일에 권한이 부여
- 크게 3가지로 파일의 권한을 부여할 수 있으며, **읽기(Reading), 쓰기(writing), 실행(executing)**으로 분류
- 위 숫자는 각각 8진수로 나타냄(7의 경우 읽기(4) + 쓰기(2) + 실행(1) 모두 가능)
- 만약 777의 권한이 부여될 경우 각 자리는 누구에게 권한을 부여하는가를 나타냄<br>
  **소유자 권한, 그룹 사용자 권한, 기타 사용자 권한**을 의미
- 즉, 755의 권한이라면 소유자는 읽기, 쓰기, 실행이 가능하나 그 외 사용자는 쓰기만 불가능<br>
<br>

### chmod
- `chmod` 명령어를 사용하여 파일 또는 디렉토리(폴더)에 권한을 부여, 수정 가능
- 만약 모든 사용자에 대해 읽기, 쓰기, 실행의 권한을 부여한다면 아래와 같은 명령어로 부여가능<br>
  ```
    chmod -R 777 filename
  ```

### chown
- 리눅스는 파일 및 경로에 소유자와 그룹 사용자를 지정 가능
